# InvalidSlantedColumnOffsets Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..InvalidSlantedColumnOffsets Property
BuiltInFailures..::..FamilyFailures Class See Also
---
The column's base (Base Level + Base Offset) must be below its top (Top Level + Top Offset).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidSlantedColumnOffsets { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidSlantedColumnOffsets As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidSlantedColumnOffsets {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace